app/controllers/orders_controller.rb

  def index
		if current_user
	    @orders = current_user.orders
---
SELECT * FROM "orders" WHERE ("orders".user_id = 1)