app/controllers/screenshots_controller.rb

SELECT * FROM "screenshots"
---
  def index
    @screenshots = Screenshot.all