app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "password_salt", "persistence_token", "shots", "email", "created_at") VALUES('2010-08-31 19:36:20', '0a5948de5456df38a23881c6f545209015a3886dea1ddb3e81c05668d9cf47826eee0f6f04938db856b84a8d1cf57bb03b58e71b709883b24754e7f5d4eb9afe', '9pkTEU_b_AIWtg7-DV8r', '914d821d0ffd0fde8d684d17b683cb0c050ae4588b04e849a5360cd3e44c9fbaf7ad69b601e463e2558bcdc289d7b261fcbe740c988569e181c094d3939e1c39', NULL, 'epicwin@epicwin.com', '2010-08-31 19:36:20')